run/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "51";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

     internalField   nonuniform List<scalar> 
1024
(
0.0605871874482
0.162510386553
0.240829448454
0.301011729184
0.347216681091
0.382664478589
0.409853922717
0.430713197004
...
)
;

boundaryField
{
    left
    {
        type            KovasznayNeumannP;
        Re              5;
        value           nonuniform List<scalar> 
32
(
-0.0060109223087
-0.00645675353588
-0.00561138870834
-0.00399556113522
-0.00202243785848
3.91994804506e-06
0.0017936840119
0.00309965418456
...
)
;
    }
    right
    {
        type            KovasznayDirichletP;
        Re              5;
        value           uniform 0.49990073378;
    }
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            KovasznayNeumannP;
        Re              5;
        value           nonuniform List<scalar> 
32
(
0.0605871874365
0.16251038654
0.240829448441
0.301011729169
0.347216681075
0.382664478572
0.4098539227
0.430713196986
...
)
;
    }
    bottom
    {
        type            KovasznayNeumannP;
        Re              5;
        value           nonuniform List<scalar> 
32
(
0.0605871874482
0.162510386553
0.240829448454
0.301011729184
0.347216681091
0.382664478589
0.409853922717
0.430713197004
...
)
;
    }
}


// ************************************************************************* //
